*** Evaluating code blocks

#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp
  (+ 1 2 3 4)
#+END_SRC

#+RESULTS:
: 10
#+END_EXAMPLE

